#include <iostream>

using namespace std;

int main()
{
    int a = 5, b = 3, c = 2, d = 4;

    // Вираз: 2049 * b + (d*15+12*a)/(2048) - c * 100 + d * 104
    // Переписуємо з використанням зсувів:
    // 2049 * b = (b << 11) + b  // 2048 * b + b
    // (d * 15 + 12 * a) / 2048 = (d * 15 + 12 * a) >> 11  // ділення на 2048
    // Замінимо інші множення на суму зсувів:
    // d * 15 = (d << 4) - d  // 16 * d - d
    // 12 * a = (a << 3) + (a << 2)  // 8 * a + 4 * a
    // c * 100 = (c << 6) + (c << 5) + (c << 2)  // 64 * c + 32 * c + 4 * c
    // d * 104 = (d << 6) + (d << 5) + (d << 3)  // 64 * d + 32 * d + 8 * d

    int result = ((b << 11) + b) + (((d << 4) - d + ((a << 3) + (a << 2))) >> 11)
        - ((c << 6) + (c << 5) + (c << 2))
        + ((d << 6) + (d << 5) + (d << 3));

    
    cout << "Result: " << result <<endl;

    return 0;
}